snlkuharlocal/src/InformationRegisters/ПолномочияПользователей/ПолномочияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолномочияПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полномочие</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПолномочияПользователей/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	ИсходныйНабор=РегистрыСведений.ПолномочияПользователей.СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ЗаполнитьЗначенияСвойств(ИсходныйНабор.Отбор[ЭлементОтбора.Имя],ЭлементОтбора);
	КонецЦикла; 
	
	ИсходныйНабор.Прочитать();
	ТИН=ИсходныйНабор.Выгрузить();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		СтрокаТИН=ТИН.Найти(Запись.Полномочие,"Полномочие");
		
		БылоЗначение=?(СтрокаТИН=Неопределено,Неопределено,СтрокаТИН.Значение);		
		Если БылоЗначение<>Запись.Значение Тогда
			//Функция ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт

			ЗаписатьВЛог("Полномочия","Изменено полномочие пользователя. Пользователь: "+СокрЛП(Запись.Пользователь)+",
										|полномочие: "+Запись.Полномочие+".
										|Старое значение:"+БылоЗначение+", новое значение: "+Запись.Значение,"Информация");	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
